package mongkhonsin.atsadawut.didyouknow.model;


// class ชุดของคำถาม
public class QuestionAndAnswerList {
    static public QuestionAndAnswer[] animalCategoryList = {
            // 1
            new QuestionAndAnswer(
                    "สัตว์เลี้ยงลูกด้วยนมที่อยู่ในน้ำ คือข้อใด",
                    "ปลาหมึก",
                    "ปลาโลมา",
                    "ปลากระเบน",
                    "ปลาไหล",
                    "ปลาโลมา"),
            // 2
            new QuestionAndAnswer(
                    "สัตว์ในข้อใดจัดเป็นสัตว์เลือดอุ่นทั้งหมด",
                    "เสือ จระเข้",
                    "วัว กบ",
                    "กระรอก เต่า",
                    "ชะนี นกยูง",
                    "ชะนี นกยูง"),
            // 3
            new QuestionAndAnswer(
                    "ข้อใดไม่ใช่สัตว์เลี้ยงลูกด้วยนม",
                    "แมว",
                    "กิ่งก่า",
                    "ค้างคาว",
                    "ปลาพะยูน",
                    "กิ่งก่า"),
            // 4
            new QuestionAndAnswer(
                    "สัตว์ชนิดใดไม่จัดอยู่ในพวกสัตว์ปีก",
                    "นกแก้ว",
                    "ค้างคาว",
                    "นกขุนทอง",
                    "นกกระจอกเทศ",
                    "ค้างคาว"),
            // 5
            new QuestionAndAnswer(
                    "ข้อใดที่เป็นลักษณะเหมือนกับของสัตว์ครึ่งน้ำครึ่งบกและสัตว์เลื้อยคลาน",
                    "การเคลื่อนที่",
                    "ลักษณะผิวหนัง",
                    "ไข่มีเปลือกหุ้มแข็ง",
                    "อุณหภูมร่างกาย",
                    "อุณหภูมร่างกาย")
    };
    static public QuestionAndAnswer[] generalCategoryList ={
            // 1
            new QuestionAndAnswer(
                    "ประธานอาเซียนปี 2563 คือประเทศใด",
                    "เวียดนาม",
                    "มาเลเซีย",
                    "สิงคโปร์",
                    "ไทย",
                    "เวียดนาม"),
            // 2
            new QuestionAndAnswer(
                    "กีฬาซีเกมส์ปี 2019 จัดที่ประเทศใด",
                    "เมียนมาร์",
                    "ฟิลิปปินส์",
                    "สิงคโปร์",
                    "เวียดนาม",
                    "ฟิลิปปินส์"),
            // 3
            new QuestionAndAnswer(
                    "กีฬาโอลิมปิก 2020 จัดที่ประเทศใด",
                    "ฟิลิปปินส์",
                    "ญี่ปุ่น",
                    "อังกฤษ",
                    "บราซิล",
                    "ญี่ปุ่น"),
            // 4
            new QuestionAndAnswer(
                    "การแข่งขันกีฬาโอลิมปิก 2020 จัดเป็นครั้งที่เท่าไร",
                    "30",
                    "31",
                    "32",
                    "33",
                    "32"),
            // 5
            new QuestionAndAnswer(
                    "ผู้ชนะการประกวดมิสยูนิเวิร์ส 2019 คือประเทศใด",
                    "แอฟริกาใต้",
                    "สหรัฐอเมริกา",
                    "ไทย",
                    "แคนาดา",
                    "แอฟริกาใต้")
    };
    static public QuestionAndAnswer[] foodCategoryList ={
            // 1
            new QuestionAndAnswer(
                    "เนื้อเค็ม กินกับเครื่องเคียงใด",
                    "ไข่เจียว",
                    "แกงจืด",
                    "แกงเผ็ด",
                    "แกงส้มผักรวม",
                    "แกงส้มผักรวม"),
            // 2
            new QuestionAndAnswer(
                    "ข้าวคลุกกระปิ มีเครื่องแนมในข้อใด",
                    "เนื้อทอด",
                    "ไข่ดาว",
                    "ไข่ลูกเขย",
                    "หมูหวาน",
                    "หมูหวาน"),
            // 3
            new QuestionAndAnswer(
                    "คำว่า อาหารที่ต้องจัดเข้าชุดกันประกอบด้วยอาหารประเภทใด",
                    "ต้ม ผัด",
                    "แกง ทอด ยำ",
                    "น้ำพริก ผักลวกผักสด",
                    "ถูกทุกข้อ",
                    "ถูกทุกข้อ"),
            // 4
            new QuestionAndAnswer(
                    "ข้อใดคืออาหารภาคกลาง",
                    "ข้าวสวย แกงมัสมั่น",
                    "ข้าวเหนียว น้ำพริกหนุ่ม",
                    "เข้าเหนียว ลาบเป็ด",
                    "ข้าวสวย แกงเหลือง",
                    "ข้าวสวย แกงมัสมั่น"),
            // 5
            new QuestionAndAnswer(
                    "ข้อใดคืออาหารภาคเหนือ",
                    "ต้มยำกุ้ง",
                    "ใสอั่ว",
                    "แกงไตปลา",
                    "แกงเขียวหวาน",
                    "ใสอั่ว")
    };
    static public QuestionAndAnswer[] artistCategoryList ={
            // 1
            new QuestionAndAnswer(
                    "ความงามที่แสดงออกเกี่ยวกับเส้น สี แสงเงา รูปร่าง ความรู้สึก คืออะไร",
                    "ดนตรี",
                    "จิตรกรรม",
                    "ประติมากรรม",
                    "สถาปัตยกรรม",
                    "สถาปัตยกรรม"),
            // 2
            new QuestionAndAnswer(
                    "พฤติกรรมอย่างไรของบุคคลซึ่งแสดงว่าเข้าถึงศิลปะ",
                    "รับรู้และยินดี",
                    "มองเห็นคุณค่า",
                    "เข้าใจและซาบซึ้ง",
                    "ชื่นชอบและสนใจ",
                    "มองเห็นคุณค่า"),
            // 3
            new QuestionAndAnswer(
                    "ศิลปะประเภทใดที่เหมาะในการนำมาจัดแสดงในสวนสาธารณะ",
                    "ภาพถ่าย",
                    "ภาพพิมพ์",
                    "จิตรกรรม",
                    "ประติมากรรม",
                    "ภาพถ่าย"),
            // 4
            new QuestionAndAnswer(
                    "ลักษณะผิวหยาบให้ความรู้สึกอย่างไร",
                    "แข็งแรง สง่างาม สุภาพ",
                    "แข็งแรง อ่อนไหว สุภาพ",
                    "แข็งแรง กระด้าง หนักแน่น",
                    "แข็งแรง เคลื่อนไหว น่ากลัว",
                    "แข็งแรง กระด้าง หนักแน่น"),
            // 5
            new QuestionAndAnswer(
                    "ข้อใดเป็นวิธีการปลูกฝังความรักในธรรมชาติและสิ่งแวดล้อม",
                    "วาดภาพสัตว์",
                    "วาดภาพทิวทัศน์",
                    "ปั้นรูปวิถีชีวิตผู้คน",
                    "ถูกทุกข้อ",
                    "ถูกทุกข้อ")
    };
}
